{
    "version": "2.5.8",
    "descriptions": [
        "We have renewed all our 3d audio features! (We had to) We believe it will be more optimized and stable now",
        "The sounds you play on the server side will now synchronize with everyone! It will play at the same second for everyone! (1 or 1.5 seconds may deviate)",
        "The search api is ON YOUR SERVER! Now we can run the server directly with fivem without having to deal with the crap of our servers and without having to run anything extra!",
        "We removed the Config.SleepDistance and now all sounds will work according to the maxDistance data. And songs will be rendered to maxDistance. This gave us about 200% optimization.",
        "Filters will be more stable now. Before there was no such thing as deleting the filter completely. We used to cheat by just changing the settings of the filter. Now filters can be deleted completely.",
        "We now support youtube radios!",
        "Prepare has been deprecated. You can now use direct play export like before.",
        "The stop export is directly destroys the player now, so you need to choose to use pause or stop exports to your needs.",
        "Fixed error spam in F8",
        "Added `onPlayEnd` export",
        "Now spotify-uri will be provided locally. No need to install with nodejs",
        "Fix volume is not synced when filter is applied to the sound",
        "Now the filter and sound will update on every tick instead of updating instantly. I believe this will be more stable",
        "Added support for external sounds",
        "Added direct url to the info and search.",
        "Performance and major stabilization improvements",
        "Fixed a issue with modules can not installing",
        "Fixed issue with iframe stays in dom after song destroy",
        "Surround no longer has any ui crashes in normal use and memory is well managed.",
        "Since react is a heavy library and we don't use most of react's features, surround no longer uses react.",
        "Fixed the issue where even if you stop the song, the song stays on for players coming from far.",
        "Fixed Youtube play bug issues.",
        "Now when you use pause and do not interact with the song for 5 minutes, the song will stop. The reason for this is to manage memory well. Don't forget iframe is heavy",
        "Sounds that are no longer nearby are no longer initialized on startup. In this way, unnecessary iframe usage in dom will be minimized",
        "Fix seek is not working",
        "Fix local audios duplicating",
        "Fix spotify thumbnail path",
        "Fixed stopped songs playing when the player enters the game",
        "Default thumbnail set for playlists without spotify thumbnail",
        "fixed an issue where local sounds were created before the context was created",
        "fixed the song playing automatically again after finish.",
        "fixed the problem of pulling the url and information of a youtube song. But youtube key is used for this too. So youtube key is now used for 2 things: youtube playlist, youtube url",
        "Better handler for doors and trunk.",
        "Fix spotify search track issue"
    ]
}
