{
    "version": "2.2.5",
    "descriptions": [
        "Stereo panner removed, now always using spatial panner",
        "Fixed sound explosion at the start of a song, when entering or exiting an interior, vehicle, and when audio first starts",
        "Added async sound play export for server side. So you can play your asset sounds faster, check the docs for details.",
        "It's now possible to connect a player or entity directly to a server side async play export",
        "You can play sub 1 second songs more cleanly than before",
        "Fixed sound explosion when you get too close to the location where a sound is playing",
        "Fixed PlaySoundAsync not becoming stereo at startup when attachEntity is given",
        "Fixed muffled stereo sound",
        "Fixed songs sometimes not being loaded by some players.",
        "Fixed a looped song not checking the distance when it replay",
        "Hotfix for spam",
        "Fixed a looped song not repeating again after a while",
        "Added new export `Prepare`. For Youtube, Spotify and Soundcloud this must be used once. If not, the song will not play. (It only needs to be called 1 time, which makes the link ready. Calling it more than once will result in an error)",
        "With `Prepare` export you can do error expection. Check the docs for details",
        "Fixed static sounds problem",
        "Fixed a problem that caused sound problem after seek",
        "Api has been added to surround's files as open source.",
        "The code has been minimised and turned into an exe so that the api can be easily used by everyone. It can be downloaded and run directly.",
        "This is not something like leaving the project or something like that, you can now create and manage your own api yourself.",
        "Update api error messages",
        "Delete api from source",
        "Addedinvoking resource to debug",
        "Fix `InitStaticSoundsToPlayer` error when streamer mode is enabled",
        "When streamermode is active, now can play stereo sounds. But server side exports are not allowed. Just client side exports allowed.",
        "Now an attached song will be deleted when the vehicle is deleted. This will solve the problem of hearing songs playing in other vehicles when people get into them.",
        "Fixed error spam in F8"
    ]
}
